app/controllers/articulos_controller.rb

SELECT "articulos".* FROM "articulos"
---
  def index
    @articulos = Articulo.all

INSERT INTO "articulos" ("user_id", "titulo", "fecha", "imagen", "altimg", "contenido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @articulo = Articulo.new(articulo_params)
    @articulo.user = current_user
    respond_to do |format|
      if @articulo.save

UPDATE "articulos" SET "imagen" = $1, "updated_at" = $2 WHERE "articulos"."id" = $3  [["imagen", "https://www.dream-alcala.com/wp-content/uploads/2017/07/inundacion-paracuellos-2.jpg"], ["updated_at", "2018-06-07 16:17:29.999650"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @articulo.update(articulo_params)

DELETE FROM "articulos" WHERE "articulos"."id" = $1  [["id", 5]]
---
  def destroy
    @articulo.destroy

SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_articulo
      @articulo = Articulo.find(params[:id])