app/controllers/contactos_controller.rb

  def index
    @contactos = Contacto.all
---
SELECT "contactos".* FROM "contactos"

  def create
    @contacto = Contacto.new(contacto_params)

    respond_to do |format|
      if @contacto.save
---
INSERT INTO "contactos" ("asunto", "email", "mensaje", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["asunto", "Hola!!"], ["email", "brianf_lp@hotmail.com"], ["mensaje", "este es un contacto"], ["created_at", "2018-06-08 16:38:54.503451"], ["updated_at", "2018-06-08 16:38:54.503451"]]