app/controllers/novedads_controller.rb

  def index
    @novedads = Novedad.all
---
SELECT "novedads".* FROM "novedads"

  def create
    @novedad = Novedad.new(novedad_params)

    respond_to do |format|
      if @novedad.save
---
INSERT INTO "novedads" ("user_id", "titulo", "fecha", "copete", "imagen", "altimg", "contenido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @novedad.update(novedad_params)
---
UPDATE "novedads" SET "imagen" = $1, "updated_at" = $2 WHERE "novedads"."id" = $3

  def destroy
    @novedad.destroy
---
DELETE FROM "novedads" WHERE "novedads"."id" = $1  [["id", 1]]

    def set_novedad
      @novedad = Novedad.find(params[:id])
---
SELECT  "novedads".* FROM "novedads" WHERE "novedads"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]